Revit 2024 API
DocumentEntryPoint Constructor
Initializes a new instance of the DocumentEntryPoint class
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DocumentEntryPoint()
Visual Basic
Public Sub New
Visual C++
public:
DocumentEntryPoint()
See Also
DocumentEntryPoint Class
Autodesk.Revit.UI.Macros Namespace